In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("C:/Users/Test/Downloads/Uncleaned_Business_Performance_Dataset_500_Rows.csv")
df

,Date,Business_Unit,Region,Revenue,Cost,Operating_Expense,Employee_Count,Attrition_Count,Customer_Count,Customer_Churn,Marketing_Spend,Production_Volume
0,2023-07-05 00:00:00,Logistics,NaN,421313.20,199384.13,7915.44,73.0,17.0,2182.0,36.0,7852.26,9875.0
1,2023-03-10 00:00:00,IT Services,south,68113.39,100589.35,48374.80,232.0,22.0,1445.0,1.0,104430.43,7772.0
2,2024-01-21 00:00:00,Logistics,south,304861.75,73686.35,61999.14,217.0,22.0,1752.0,12.0,49393.16,5087.0
3,2023-02-25 00:00:00,Manufacturing,south,571615.47,264204.25,91119.00,340.0,17.0,946.0,26.0,104638.09,450.0
4,2023-06-26 00:00:00,IT Services,south,497192.20,200696.00,144723.53,512.0,15.0,2839.0,33.0,73261.71,2491.0
...,...,...,...,...,...,...,...,...,...,...,...,...
495,2024-02-05 00:00:00,Retail,East,344954.89,83251.43,71730.53,272.0,-2.0,2329.0,26.0,12626.28,9393.0
496,2024-10-28 00:00:00,retail,NORTH,321603.45,324818.80,150267.33,431.0,5.0,394.0,9.0,112393.83,6564.0
497,2023-10-12 00:00:00,NaN,south,222180.21,210037.47,136543.67,NaN,18.0,1300.0,28.0,72820.01,8590.0
498,2023-10-22 00:00:00,IT Services,East,411378.35,211940.38,33844.12,163.0,13.0,684.0,42.0,36386.75,10823.0
499,2024-05-13 00:00:00,Logistics,NaN,490767.61,35166.07,42562.94,26.0,11.0,-7.0,22.0,40735.41,6149.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               500 non-null    object
 1   Business_Unit      368 non-null    object
 2   Region             416 non-null    object
 3   Revenue            458 non-null    float64
 4   Cost               471 non-null    float64
 5   Operating_Expense  472 non-null    float64
 6   Employee_Count     467 non-null    float64
 7   Attrition_Count    462 non-null    float64
 8   Customer_Count     469 non-null    float64
 9   Customer_Churn     472 non-null    float64
 10  Marketing_Spend    470 non-null    float64
 11  Production_Volume  469 non-null    float64
dtypes: float64(9), object(3)
memory usage: 47.0+ KB

In [4]:
df.isna().sum()

Date                   0
Business_Unit        132
Region                84
Revenue               42
Cost                  29
Operating_Expense     28
Employee_Count        33
Attrition_Count       38
Customer_Count        31
Customer_Churn        28
Marketing_Spend       30
Production_Volume     31
dtype: int64

In [5]:
df.head()

,Date,Business_Unit,Region,Revenue,Cost,Operating_Expense,Employee_Count,Attrition_Count,Customer_Count,Customer_Churn,Marketing_Spend,Production_Volume
0,2023-07-05 00:00:00,Logistics,NaN,421313.20,199384.13,7915.44,73.0,17.0,2182.0,36.0,7852.26,9875.0
1,2023-03-10 00:00:00,IT Services,south,68113.39,100589.35,48374.80,232.0,22.0,1445.0,1.0,104430.43,7772.0
2,2024-01-21 00:00:00,Logistics,south,304861.75,73686.35,61999.14,217.0,22.0,1752.0,12.0,49393.16,5087.0
3,2023-02-25 00:00:00,Manufacturing,south,571615.47,264204.25,91119.00,340.0,17.0,946.0,26.0,104638.09,450.0
4,2023-06-26 00:00:00,IT Services,south,497192.20,200696.00,144723.53,512.0,15.0,2839.0,33.0,73261.71,2491.0

In [6]:
df.describe()

,Revenue,Cost,Operating_Expense,Employee_Count,Attrition_Count,Customer_Count,Customer_Churn,Marketing_Spend,Production_Volume
count,458.000000,471.000000,472.000000,467.000000,462.000000,469.000000,472.000000,470.000000,469.000000
mean,301261.571070,193142.899342,96886.204004,279.837259,12.352814,1461.249467,22.197034,61387.931085,7668.142857
std,178299.268711,112657.479500,58100.829874,175.956111,9.304151,943.716152,15.336057,35253.839946,4303.735061
min,-17391.090000,-9881.840000,-4858.930000,-15.000000,-3.000000,-43.000000,-5.000000,-1101.020000,-66.000000
25%,164735.917500,100646.340000,45039.675000,128.000000,4.000000,600.000000,8.000000,31721.742500,4148.000000
50%,312564.170000,192356.880000,95392.905000,275.000000,12.000000,1479.000000,22.000000,64238.235000,7765.000000
75%,460372.682500,284596.135000,146092.015000,428.000000,20.000000,2304.000000,36.000000,90300.057500,11199.000000
max,599828.020000,397761.450000,199624.510000,596.000000,29.000000,2998.000000,49.000000,119904.510000,14999.000000

In [13]:
df['Date'] = pd.to_datetime(
    df['Date'],
    errors='coerce',
    dayfirst=True
)

In [18]:
df['Date'].head(10)

0   2023-05-07
1   2023-10-03
2          NaT
3          NaT
4          NaT
5          NaT
6   2023-02-09
7   2023-12-07
8          NaT
9          NaT
Name: Date, dtype: datetime64[ns]

In [17]:
df['Date'].isna().sum()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               178 non-null    datetime64[ns]
 1   Business_Unit      368 non-null    object
 2   Region             416 non-null    object
 3   Revenue            458 non-null    float64
 4   Cost               471 non-null    float64
 5   Operating_Expense  472 non-null    float64
 6   Employee_Count     467 non-null    float64
 7   Attrition_Count    462 non-null    float64
 8   Customer_Count     469 non-null    float64
 9   Customer_Churn     472 non-null    float64
 10  Marketing_Spend    470 non-null    float64
 11  Production_Volume  469 non-null    float64
dtypes: datetime64[ns](1), float64(9), object(2)
memory usage: 47.0+ KB

In [23]:
df['Business_Unit'] = (df['Business_Unit'].str.strip().str.title().fillna('Unknown'))
df['Region'] = (df['Region'].str.strip().str.title().fillna('Unknown'))

In [24]:
df.head()

,Date,Business_Unit,Region,Revenue,Cost,Operating_Expense,Employee_Count,Attrition_Count,Customer_Count,Customer_Churn,Marketing_Spend,Production_Volume
0,2023-07-05 00:00:00,Logistics,Unknown,421313.20,199384.13,7915.44,73.0,17.0,2182.0,36.0,7852.26,9875.0
1,2023-03-10 00:00:00,It Services,South,68113.39,100589.35,48374.80,232.0,22.0,1445.0,1.0,104430.43,7772.0
2,2024-01-21 00:00:00,Logistics,South,304861.75,73686.35,61999.14,217.0,22.0,1752.0,12.0,49393.16,5087.0
3,2023-02-25 00:00:00,Manufacturing,South,571615.47,264204.25,91119.00,340.0,17.0,946.0,26.0,104638.09,450.0
4,2023-06-26 00:00:00,It Services,South,497192.20,200696.00,144723.53,512.0,15.0,2839.0,33.0,73261.71,2491.0

In [25]:
import numpy as np

In [26]:
numeric_cols = [
    'Revenue', 'Cost', 'Operating_Expense',
    'Employee_Count', 'Customer_Count',
    'Marketing_Spend', 'Production_Volume'
]
for col in numeric_cols:
    df[col] = df[col].apply(lambda x: x if x >= 0 else np.nan)

In [27]:
df.loc[df['Attrition_Count'] > df['Employee_Count'], 'Attrition_Count'] = np.nan
df.loc[df['Customer_Churn'] > df['Customer_Count'], 'Customer_Churn'] = np.nan

In [32]:
df['Revenue'] = df['Revenue'].fillna(df['Revenue'].median())

In [35]:
df['Revenue'].isna().sum()
df['Revenue'].describe()

count       500.000000
mean     313330.684120
std      161654.360762
min        1611.210000
25%      198610.697500
50%      325360.270000
75%      448861.975000
max      599828.020000
Name: Revenue, dtype: float64

In [36]:
df['Cost'] = df['Cost'].fillna(df['Cost'].median())
df['Operating_Expense'] = df['Operating_Expense'].fillna(df['Operating_Expense'].median())
df['Employee_Count'] = df['Employee_Count'].fillna(df['Employee_Count'].median())
df['Customer_Count'] = df['Customer_Count'].fillna(df['Customer_Count'].median())

In [38]:
df.isna().sum()

Date                  0
Business_Unit         0
Region                0
Revenue               0
Cost                  0
Operating_Expense     0
Employee_Count        0
Attrition_Count      44
Customer_Count        0
Customer_Churn       33
Marketing_Spend      37
Production_Volume    33
dtype: int64

In [39]:
df.isna().any()

Date                 False
Business_Unit        False
Region               False
Revenue              False
Cost                 False
Operating_Expense    False
Employee_Count       False
Attrition_Count       True
Customer_Count       False
Customer_Churn        True
Marketing_Spend       True
Production_Volume     True
dtype: bool

In [40]:
df['Marketing_Spend'] = df['Marketing_Spend'].fillna(0)

In [41]:
df['Production_Volume'] = df['Production_Volume'].fillna(
    df['Production_Volume'].median())

In [43]:
df.to_csv("C:/Users/Test/Desktop/Cleaned_Business_Performance_Dataset.csv", index=False)

In [44]:
df['Date'].isna().sum()

np.int64(0)

In [45]:
df['Date'].head(10)

0    2023-07-05 00:00:00
1    2023-03-10 00:00:00
2    2024-01-21 00:00:00
3    2023-02-25 00:00:00
4    2023-06-26 00:00:00
5           invalid_date
6    2023-09-02 00:00:00
7    2023-07-12 00:00:00
8    2023-01-21 00:00:00
9    2024-08-14 00:00:00
Name: Date, dtype: object

In [47]:
df['Date'] = df['Date'].astype(str)

In [48]:
df['Date'] = pd.to_datetime(df['Date'], errors='coerce')

In [49]:
df['Date'].head(10)

0   2023-07-05
1   2023-03-10
2   2024-01-21
3   2023-02-25
4   2023-06-26
5          NaT
6   2023-09-02
7   2023-07-12
8   2023-01-21
9   2024-08-14
Name: Date, dtype: datetime64[ns]

In [50]:
df.loc[df['Attrition_Count'] < 0, 'Attrition_Count'] = np.nan

In [51]:
df['Attrition_Count'].head(10)

0    17.0
1    22.0
2    22.0
3    17.0
4    15.0
5    24.0
6     1.0
7     NaN
8    13.0
9    26.0
Name: Attrition_Count, dtype: float64

In [52]:
df.to_csv("C:/Users/Test/Desktop/Cleaned_Business_Performance_Dataset_001.csv", index=False)